In [35]:
import pandas as pd
import numpy as np
import matplotlib as plt

ds = pd.read_csv("E:/MissingValueProject1/EmpData.txt", sep ="\t")
ds.head()

       Name  Position  Office   Age  Start_Date   Salary
0  Priyanka  Lecturer    Pune  28.0  15/06/2015  31000.0
1     Kirti     Coder  Nashik  27.0  15/06/2013  41000.0
2       NaN       NaN     NaN   NaN         NaN      NaN
3    Mrunal    Tester      UK  22.0  21/07/2013  32000.0
4    Rasika    Tester  Nashik  21.0  20/08/2016  25000.0

In [39]:
# Displaying data of particular column

cols = ['Name', 'Position']
ds[cols].head(7)

       Name        Position
0  Priyanka        Lecturer
1     Kirti           Coder
2       NaN             NaN
3    Mrunal          Tester
4    Rasika          Tester
5      Teju           Coder
6    Ujwala  Senior Manager

In [37]:
# Displaying data of particular column
ds['Name'].head()

0    Priyanka
1       Kirti
2         NaN
3      Mrunal
4      Rasika
Name: Name, dtype: object

In [15]:
# Displaying specific number of rows

ds = pd.read_csv("E:/MissingValueProject1/EmpData.txt", sep = "\t", nrows = 2)
ds

       Name  Position  Office  Age  Start_Date  Salary
0  Priyanka  Lecturer    Pune   28  15/06/2015   31000
1     Kirti     Coder  Nashik   27  15/06/2013   41000

In [16]:
# Displaying data types of columns

ds.dtypes

Name          object
Position      object
Office        object
Age            int64
Start_Date    object
Salary         int64
dtype: object

In [17]:
# Displaying columns with particular data types
ds.select_dtypes(include = [np.number]).dtypes

Age       int64
Salary    int64
dtype: object

In [19]:
# Displaying information about data frame
ds.describe()

             Age        Salary
count   2.000000      2.000000
mean   27.500000  36000.000000
std     0.707107   7071.067812
min    27.000000  31000.000000
25%    27.250000  33500.000000
50%    27.500000  36000.000000
75%    27.750000  38500.000000
max    28.000000  41000.000000

In [20]:
# Displaying number of rows and columns
ds.shape

(2, 6)

In [21]:
# Displaying data types of columns
type('Age')

str

In [22]:
# Displaying data type of data frame
type(ds)

pandas.core.frame.DataFrame

In [32]:
# Concatinating multiple columns into single column
ds = pd.read_csv("E:/MissingValueProject1/EmpData.txt", sep = "\t")
ds['NameAge'] = ds['Name'] + ds['Age']
ds['NameAge'].head()

0    Priyanka28
1       Kirti27
2           NaN
3      Mrunal22
4      Rasika21
Name: NameAge, dtype: object

In [33]:
# deleting columns from dataframe
ds.drop('NameAge', axis = 1, inplace = True)
ds

       Name        Position  Office         Age  Start_Date   Salary
0  Priyanka        Lecturer    Pune          28  15/06/2015  31000.0
1     Kirti           Coder  Nashik          27  15/06/2013  41000.0
2       NaN             NaN     NaN         NaN         NaN      NaN
3    Mrunal          Tester      UK          22  21/07/2013  32000.0
4    Rasika          Tester  Nashik          21  20/08/2016  25000.0
5      Teju           Coder  Nashik          22  26/08/2015  26000.0
6    Ujwala  Senior Manager      31  26/08/2015       40000      NaN

In [40]:
# Changing names of the columns
cols = ['Name', 'Pos', 'Office', 'Age', 'Start_Date', 'Sal']
ds.columns = cols
ds.head()

       Name       Pos  Office   Age  Start_Date      Sal
0  Priyanka  Lecturer    Pune  28.0  15/06/2015  31000.0
1     Kirti     Coder  Nashik  27.0  15/06/2013  41000.0
2       NaN       NaN     NaN   NaN         NaN      NaN
3    Mrunal    Tester      UK  22.0  21/07/2013  32000.0
4    Rasika    Tester  Nashik  21.0  20/08/2016  25000.0

In [41]:
# Sorting data 
sv = ds.sort_values(by = 'Age', ascending = True)
sv

       Name             Pos  Office   Age  Start_Date      Sal
4    Rasika          Tester  Nashik  21.0  20/08/2016  25000.0
3    Mrunal          Tester      UK  22.0  21/07/2013  32000.0
5      Teju           Coder  Nashik  22.0  26/08/2015  26000.0
1     Kirti           Coder  Nashik  27.0  15/06/2013  41000.0
0  Priyanka        Lecturer    Pune  28.0  15/06/2015  31000.0
6    Ujwala  Senior Manager    Pune  31.0  26/08/2015  40000.0
2       NaN             NaN     NaN   NaN         NaN      NaN

In [42]:
# Sorting data by descending values
sv = ds.sort_values(by = 'Age', ascending = False)
sv

       Name             Pos  Office   Age  Start_Date      Sal
6    Ujwala  Senior Manager    Pune  31.0  26/08/2015  40000.0
0  Priyanka        Lecturer    Pune  28.0  15/06/2015  31000.0
1     Kirti           Coder  Nashik  27.0  15/06/2013  41000.0
3    Mrunal          Tester      UK  22.0  21/07/2013  32000.0
5      Teju           Coder  Nashik  22.0  26/08/2015  26000.0
4    Rasika          Tester  Nashik  21.0  20/08/2016  25000.0
2       NaN             NaN     NaN   NaN         NaN      NaN

In [43]:
# filtering of data

res = ds[ds.Age > 25]
res

       Name             Pos  Office   Age  Start_Date      Sal
0  Priyanka        Lecturer    Pune  28.0  15/06/2015  31000.0
1     Kirti           Coder  Nashik  27.0  15/06/2013  41000.0
6    Ujwala  Senior Manager    Pune  31.0  26/08/2015  40000.0

In [45]:
# filtering using multiple conditions

res = ds[(ds.Age > 25) & (ds.Sal > 30000)]
res

       Name             Pos  Office   Age  Start_Date      Sal
0  Priyanka        Lecturer    Pune  28.0  15/06/2015  31000.0
1     Kirti           Coder  Nashik  27.0  15/06/2013  41000.0
6    Ujwala  Senior Manager    Pune  31.0  26/08/2015  40000.0

In [52]:
# Displaying specific columns after filtering
cols = ['Name', 'Pos']
ds[ds.Age > 25][cols].head()

       Name             Pos
0  Priyanka        Lecturer
1     Kirti           Coder
6    Ujwala  Senior Manager

In [56]:
# calculating mean across columns
ds.mean(axis = 0)

Age       25.166667
Sal    32500.000000
dtype: float64

In [55]:
# calculating mean across rows
ds.mean(axis = 1)

0    15514.0
1    20513.5
2        NaN
3    16011.0
4    12510.5
5    13011.0
6    20015.5
dtype: float64

In [58]:
# Displaying rows where name is Priyanka or Kirti
nms = ['Priyanka', 'Kirti']
res = ds[ds.Name.isin(nms)]
res

       Name       Pos  Office   Age  Start_Date      Sal
0  Priyanka  Lecturer    Pune  28.0  15/06/2015  31000.0
1     Kirti     Coder  Nashik  27.0  15/06/2013  41000.0